Documents/ПодтверждениеОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ПодтверждениеОплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОплатаЗанятий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Занятие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Занятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОплатаЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ОплатаЗанятий</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Занятие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Занятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПодтверждениеОплаты/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	ТаблицаУроки = Занятие.Уроки.Выгрузить();
	Движения.ОплатаЗанятий.Записывать = Истина;
	
	Для Каждого ТекСтрокаУроки Из ТаблицаУроки Цикл
		Движение = Движения.ОплатаЗанятий.Добавить();
		Движение.Период					= ТекущаяДата();
		Движение.Занятие					= Занятие;
		Движение.СуммаОплаты		= ТекСтрокаУроки.Сумма;
	КонецЦикла;

КонецПроцедуры
